GetBoxOutline Method
 Returns the outline of the viewport on the sheet, excluding the viewport label.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public Outline GetBoxOutline()
Visual Basic
Public Function GetBoxOutline As Outline
Visual C++
public:
Outline^ GetBoxOutline()
Return Value
 The outline of the viewport on the sheet.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException |  The viewport is not on a sheet.
See Also
Viewport Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →